app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $transactions = $this->transactionModel
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `transaction`
ORDER BY `created_at` DESC

    public function pesanan()
    {
        $filterStatus = $this->request->getGet('status') ?? 'all';

        $query = $this->transactionModel->orderBy('created_at', 'DESC');

        if ($filterStatus !== 'all' && is_numeric($filterStatus)) {
            $query->where('status', (int) $filterStatus);
        }

        $transactions = $query->findAll();

        foreach ($transactions as &$trx) {
            $trx['details'] = $this->transactionDetailModel->getDetailWithProduct($trx['id']);
        }
        unset($trx);

        // Hitung jumlah per status untuk tab
        $countByStatus = [
            0 => $this->transactionModel->where('status', 0)->countAllResults(),
            1 => $this->transactionModel->where('status', 1)->countAllResults(),
            2 => $this->transactionModel->where('status', 2)->countAllResults(),
        ];
---
SELECT *
FROM `transaction`
ORDER BY `created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 2

    public function penghasilan()
    {
        $db = Database::connect();

        $transactions = $this->transactionModel
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `transaction`
ORDER BY `created_at` DESC

            $month     = date('m', $monthTS);
            $monthName = date('M', $monthTS);

            $row = $db->table('transaction')
                ->select('SUM(total_harga) as total, COUNT(*) as jumlah')
                ->where('YEAR(created_at)', $year)
                ->where('MONTH(created_at)', $month)
                ->get()
                ->getRowArray();
---
SELECT SUM(total_harga) as total, COUNT(*) as jumlah
FROM `transaction`
WHERE YEAR(created_at) = '2026'
AND MONTH(created_at) = '01'

        }

        // Top layanan terlaris dari transaction_detail
        $topLayanan = $db->table('transaction_detail td')
            ->select('p.nama, SUM(td.jumlah) as total_terjual, SUM(td.subtotal_harga) as total_pendapatan')
            ->join('product p', 'p.id = td.product_id', 'left')
            ->groupBy('td.product_id')
            ->orderBy('total_terjual', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `p`.`nama`, SUM(td.jumlah) as total_terjual, SUM(td.subtotal_harga) as total_pendapatan
FROM `transaction_detail` `td`
LEFT JOIN `product` `p` ON `p`.`id` = `td`.`product_id`
GROUP BY `td`.`product_id`
ORDER BY `total_terjual` DESC
 LIMIT 5

    private function getMetodeStat(): array
    {
        return Database::connect()
            ->table('transaction')
            ->select('metode_pembayaran as metode, COUNT(*) as jumlah, SUM(total_harga) as total')
            ->groupBy('metode_pembayaran')
            ->orderBy('jumlah', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `metode_pembayaran` as `metode`, COUNT(*) as jumlah, SUM(total_harga) as total
FROM `transaction`
GROUP BY `metode_pembayaran`
ORDER BY `jumlah` DESC