app/Controllers/Admin/Layanan.php

SELECT *
FROM `product`
---
    public function index()
    {
        return view('admin/layanan/index', [
            'products' => $this->layananModel->findAll(),
        ]);