app/Views/layout/admin_main.php

SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 0
---
                // Hitung pending order untuk badge
                try {
                    $trxModel = new \App\Models\TransactionModel();
                    $pendingCount = $trxModel->where('status', 0)->countAllResults();