app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'dhimas'
 LIMIT 1
---
public function login()
{
    if ($this->request->getPost()) {
        $rules = [
    'username' => 'required|min_length[6]',
    'password' => 'required|min_length[7]|numeric',
];
if ($this->validate($rules)) {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $dataUser = $this->userModel ->where(['username' => $username])->first();