app/Controllers/Home.php

    public function index()
    {
        return view('home/index', [
            'products' => $this->productModel->findAll()
        ]);
---
SELECT *
FROM `product`