app/Controllers/ProdukController.php

    public function index()
    {
        return view('produk/index', [
            'products' => $this->productModel->findAll()
        ]);
---
SELECT *
FROM `product`