app/Models/TransactionModel.php

SELECT *
FROM `transaction`
WHERE `username` = 'dian.wahyuni'
ORDER BY `created_at` DESC
---
    public function getByUsername(string $username): array
    {
        return $this->where('username', $username)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaction`
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = 2
---
    public function getStats(): array
    {
        $db = \Config\Database::connect();

        return [
            'total_transaksi'  => $this->countAll(),
            'total_pendapatan' => $db->table('transaction')->selectSum('total_harga')->get()->getRow()->total_harga ?? 0,
            'pending'          => $this->where('status', 0)->countAllResults(),
            'diproses'         => $this->where('status', 1)->countAllResults(),
            'selesai'          => $this->where('status', 2)->countAllResults(),