app/Models/TransactionDetailModel.php

    public function getDetailWithProduct(int $transactionId): array
    {
        return $this->db->table('transaction_detail td')
            ->select('td.*, p.nama, p.foto, p.harga')
            ->join('product p', 'p.id = td.product_id', 'left')
            ->where('td.transaction_id', $transactionId)
            ->get()
            ->getResultArray();
---
SELECT `td`.*, `p`.`nama`, `p`.`foto`, `p`.`harga`
FROM `transaction_detail` `td`
LEFT JOIN `product` `p` ON `p`.`id` = `td`.`product_id`
WHERE `td`.`transaction_id` = 3